app/views/posts/index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---
  <br/>
  <small><%= link_to "View full article", p %> &middot; <%= p.comments.length %> comments</small>