app/views/posts/show.html.erb

<br/>
<%= @post.comments.length %> comments
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]